{
    "1": "[NEW CONCEPT]\nWe are learning the Pythagorean Theorem. In a right triangle, the square of the hypotenuse equals the sum of the squares of the legs.\n[END CONCEPT|| Scene description:\nStatic state 1:\nDraw a right triangle with legs of length 3 and 4, and hypotenuse of length 5. Label the sides as 'a', 'b', and 'c'. [duration: 2s]\nAnimation 1:\nDraw a square outward from each side of the triangle to represent areas 9, 16, and 25. [duration: 3s]\nAnimation 2:\nDisplay the equation \"a^2 + b^2 = c^2\" and \"9 + 16 = 25\" below the triangle. Connect numbers to squares with arrows. [duration: 3s]]",
    "2": "[NEW CONCEPT]\nWe are studying the concept of limits. Consider f(x) = (x^2 - 1)/(x - 1). What happens as x approaches 1?\n[END CONCEPT|| Scene description:\nStatic state 1:\nPlot the function f(x) = (x^2 - 1)/(x - 1) on a coordinate plane. Indicate a hole at x = 1. [duration: 3s]\nAnimation 1:\nZoom into the area around x = 1. [duration: 2s]\nAnimation 2:\nShow arrows approaching x = 1 from both directions. [duration: 2s]\nAnimation 3:\nDisplay simplified form: f(x) = x + 1. Emphasize that as x approaches 1, f(x) approaches 2. [duration: 3s]\nAnimation 4:\nStep through the simplification: (x^2 - 1)/(x - 1) → (x - 1)(x + 1)/(x - 1) → x + 1. [duration: 3s]]",
    "3": "[NEW CONCEPT]\nWe are exploring the diagonalization of a matrix. A square matrix A is diagonalizable if there exists an invertible matrix P such that P inverse times A times P equals a diagonal matrix D. This occurs when A has a full set of linearly independent eigenvectors.\n[END CONCEPT|| Scene description:\nStatic state 1:\nDisplay the equation \"A = P D P inverse\" and label A as a square matrix, D as a diagonal matrix, and P as the matrix of eigenvectors. [duration: 3s]\nAnimation 1:\nIntroduce a sample matrix A: A equals the two by two matrix with rows [4, 1] and [0, 2]. [duration: 2s]\nAnimation 2:\nCompute eigenvalues by solving the characteristic equation: determinant of A minus lambda times I equals zero. Show the determinant of the matrix [4 minus lambda, 1; 0, 2 minus lambda] equals zero. Then simplify to (4 minus lambda) times (2 minus lambda) equals zero, resulting in eigenvalues lambda equals 4 and 2. [duration: 5s]\nAnimation 3:\nCompute eigenvectors for each eigenvalue. For lambda equals 4, solve A minus 4 I times v equals 0. Show steps to obtain eigenvector v1 equals [1, 0]. For lambda equals 2, solve A minus 2 I times v equals 0. Show steps to obtain eigenvector v2 equals [1, negative 2]. [duration: 6s]\nAnimation 4:\nForm matrix P with columns v1 and v2, equal to [[1, 1], [0, negative 2]]. Form diagonal matrix D as [[4, 0], [0, 2]]. Show that P inverse times A times P equals D. Emphasize that matrix A is diagonalizable. [duration: 4s]]"
}
  